name: "LeelaNet"
layer {
  type: "Data"
  name: "data"
  # outputs
  top: "data"
  include {
    phase: TRAIN
  }
  data_param {
    source: "leela_train"
    batch_size: 32
    backend: LEVELDB
  }
}

layer {
  type: "Data"
  name: "data"
  # outputs
  top: "data"
  include {
    phase: TEST
  }
  data_param {
    source: "leela_test"
    batch_size: 32
    backend: LEVELDB
  }
}

layer {
  type: "Data"
  name: "label"
  # outputs
  top: "label_unsliced"
  include {
    phase: TRAIN
  }
  data_param {
    source: "leela_train_label"
    batch_size: 32
    backend: LEVELDB
  }
}

layer {
  type: "Data"
  name: "label"
  # outputs
  top: "label_unsliced"
  include {
    phase: TEST
  }
  data_param {
    source: "leela_test_label"
    batch_size: 32
    backend: LEVELDB
  }
}

layer {
  name: "slicer_label"
  type: "Slice"
  bottom: "label_unsliced"
  top: "label_move1"
  top: "label_move2"
  top: "label_move3"
  top: "winpc"
  top: "won"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
  }
}

layer {
  name: "silence"
  type: "Silence"
  bottom: "label_move2"
  bottom: "label_move3"
  bottom: "won"
}

layer {
  name: "conv1"
  type: "Convolution"
  # input -> output
  bottom: "data"
  top: "conv1"
  # learning rate and decay multipliers for the filters
  param { lr_mult: 1 decay_mult: 1 }
  # learning rate and decay multipliers for the biases
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  # in-place
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "bn1"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}


layer {
  name: "conv2"
  type: "Convolution"
  # input -> output
  bottom: "bn1"
  top: "conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu2"
  type:  "ReLU"
  # in-place
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "bn2"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv3"
  type: "Convolution"
  # input -> output
  bottom: "bn2"
  top: "conv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  # in-place
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "bn3"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv4"
  type: "Convolution"
  # input -> output
  bottom: "bn3"
  top: "conv4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu4"
  type: "ReLU"
  # in-place
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "bn4"
  type: "BatchNorm"
  bottom: "conv4"
  top: "bn4"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv5"
  type: "Convolution"
  # input -> output
  bottom: "bn4"
  top: "conv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu5"
  type: "ReLU"
  # in-place
  bottom: "conv5"
  top: "conv5"
}

layer {
  name: "bn5"
  type: "BatchNorm"
  bottom: "conv5"
  top: "bn5"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv6"
  type: "Convolution"
  # input -> output
  bottom: "bn5"
  top: "conv6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu6"
  type: "ReLU"
  # in-place
  bottom: "conv6"
  top: "conv6"
}

layer {
  name: "bn6"
  type: "BatchNorm"
  bottom: "conv6"
  top: "bn6"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv7"
  type: "Convolution"
  # input -> output
  bottom: "bn6"
  top: "conv7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu7"
  type: "ReLU"
  # in-place
  bottom: "conv7"
  top: "conv7"
}

layer {
  name: "bn7"
  type: "BatchNorm"
  bottom: "conv7"
  top: "bn7"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv8"
  type: "Convolution"
  # input -> output
  bottom: "bn7"
  top: "conv8"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu8"
  type: "ReLU"
  # in-place
  bottom: "conv8"
  top: "conv8"
}

layer {
  name: "bn8"
  type: "BatchNorm"
  bottom: "conv8"
  top: "bn8"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv9"
  type: "Convolution"
  # input -> output
  bottom: "bn8"
  top: "conv9"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu9"
  type: "ReLU"
  # in-place
  bottom: "conv9"
  top: "conv9"
}

layer {
  name: "bn9"
  type: "BatchNorm"
  bottom: "conv9"
  top: "bn9"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "conv10"
  type: "Convolution"
  # input -> output
  bottom: "bn9"
  top: "conv10"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 4
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "slicer_output"
  type: "Slice"
  bottom: "conv10"
  top: "conv10_o1"
  top: "conv10_o2"
  slice_param {
    axis: 1
    slice_point: 1
  }
}

layer {
  name: "relu10"
  type: "ReLU"
  # in-place
  bottom: "conv10_o2"
  top: "conv10_o2"
}

layer {
  name: "bn10"
  type: "BatchNorm"
  bottom: "conv10_o2"
  top: "bn10"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}


layer {
  name: "ip11"
  type: "InnerProduct"
  # learning rate and decay multipliers for the weights
  param { lr_mult: 1 decay_mult: 1 }
  # learning rate and decay multipliers for the biases
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
  bottom: "bn10"
  top: "ip11"
}

layer {
  name: "relu11"
  type: "ReLU"
  # in-place
  bottom: "ip11"
  top: "ip11"
}

layer {
  name: "bn11"
  type: "BatchNorm"
  bottom: "ip11"
  top: "bn11"
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
  param {
    lr_mult: 0
  } 
}

layer {
  name: "ip12"
  type: "InnerProduct"
  # learning rate and decay multipliers for the weights
  param { lr_mult: 1 decay_mult: 1 }
  # learning rate and decay multipliers for the biases
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
  bottom: "bn11"
  top: "ip12"
}

layer {
  name: "flatten_o1"
  type: "Flatten"
  bottom: "conv10_o1"
  top: "flatten_o1"
}

layer {
  name: "loss_1"
  type: "SoftmaxWithLoss"
  # input
  bottom: "flatten_o1"
  bottom: "label_move1"
  # output
  top: "loss_1"
  loss_weight: 1
}

layer {
  name: "accuracy_m"
  type: "Accuracy"
  # input
  bottom: "flatten_o1"
  bottom: "label_move1"
  include {
    phase: TEST
  }
  # output
  top: "accuracy_m"
}

layer {
  name: "sigmoid"
  type: "Sigmoid"
  bottom: "ip12"
  top: "winrate"
}

layer {
  name: "loss_mse"
  type: "EuclideanLoss"
  bottom: "winrate"
  bottom: "winpc"
  top: "l2_error"
  loss_weight: 1
}
