name: "LeelaNet"
layer {
  type: "Data"
  name: "data"
  # outputs
  top: "data"
  include {
    phase: TRAIN
  }
  data_param {
    source: "leela_train"
    batch_size: 256
    backend: LEVELDB
  }
}

layer {
  type: "Data"
  name: "data"
  # outputs
  top: "data"
  include {
    phase: TEST
  }
  data_param {
    source: "leela_test"
    batch_size: 256
    backend: LEVELDB
  }
}

layer {
  type: "Data"
  name: "label"
  # outputs
  top: "label_unsliced"
  include {
    phase: TRAIN
  }
  data_param {
    source: "leela_train_label"
    batch_size: 256
    backend: LEVELDB
  }
}

layer {
  type: "Data"
  name: "label"
  # outputs
  top: "label_unsliced"
  include {
    phase: TEST
  }
  data_param {
    source: "leela_test_label"
    batch_size: 256
    backend: LEVELDB
  }
}

layer {
  name: "slicer_label"
  type: "Slice"
  bottom: "label_unsliced"
  top: "label_move1"
  top: "label_move2"
  top: "label_move3"
  top: "winpc"
  top: "won"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
  }
}

layer {
  name: "silence"
  type: "Silence"
  bottom: "winpc"
  bottom: "won"
}

layer {
  name: "conv1"
  type: "Convolution"
  # input -> output
  bottom: "data"
  top: "conv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}
layer {
  name: "elu1"
  type: "ELU"
  # in-place
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "conv2"
  type: "Convolution"
  # input -> output
  bottom: "conv1"
  top: "conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu2"
  type: "ELU"
  # in-place
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "conv3"
  type: "Convolution"
  # input -> output
  bottom: "conv2"
  top: "conv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu3"
  type: "ELU"
  # in-place
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "conv4"
  type: "Convolution"
  # input -> output
  bottom: "conv3"
  top: "conv4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu4"
  type: "ELU"
  # in-place
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "conv5"
  type: "Convolution"
  # input -> output
  bottom: "conv4"
  top: "conv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu5"
  type: "ELU"
  # in-place
  bottom: "conv5"
  top: "conv5"
}

layer {
  name: "conv6"
  type: "Convolution"
  # input -> output
  bottom: "conv5"
  top: "conv6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu6"
  type: "ELU"
  # in-place
  bottom: "conv6"
  top: "conv6"
}

layer {
  name: "conv7"
  type: "Convolution"
  # input -> output
  bottom: "conv6"
  top: "conv7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu7"
  type: "ELU"
  # in-place
  bottom: "conv7"
  top: "conv7"
}

layer {
  name: "conv8"
  type: "Convolution"
  # input -> output
  bottom: "conv7"
  top: "conv8"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu8"
  type: "ELU"
  # in-place
  bottom: "conv8"
  top: "conv8"
}

layer {
  name: "conv9"
  type: "Convolution"
  # input -> output
  bottom: "conv8"
  top: "conv9"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 160
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "elu9"
  type: "ELU"
  # in-place
  bottom: "conv9"
  top: "conv9"
}

layer {
  name: "conv10"
  type: "Convolution"
  # input -> output
  bottom: "conv9"
  top: "conv10"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "slicer_output"
  type: "Slice"
  bottom: "conv10"
  top: "conv10_o1"
  top: "conv10_o2"
  top: "conv10_o3"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
  }
}

layer {
  name: "flatten_o1"
  type: "Flatten"
  bottom: "conv10_o1"
  top: "flatten_o1"
}

layer {
  name: "flatten_o2"
  type: "Flatten"
  bottom: "conv10_o2"
  top: "flatten_o2"
}

layer {
  name: "flatten_o3"
  type: "Flatten"
  bottom: "conv10_o3"
  top: "flatten_o3"
}

layer {
  name: "loss_1"
  type: "SoftmaxWithLoss"
  # input
  bottom: "flatten_o1"
  bottom: "label_move1"
  # output
  top: "loss_1"
}

layer {
  name: "accuracy_1"
  type: "Accuracy"
  bottom: "flatten_o1"
  bottom: "label_move1"
  include { phase: TEST }
  top: "accuracy_1"
}

layer {
  name: "loss_2"
  type: "SoftmaxWithLoss"
  # input
  bottom: "flatten_o2"
  bottom: "label_move2"
  # output
  top: "loss_2"
}

layer {
  name: "accuracy_2"
  type: "Accuracy"
  bottom: "flatten_o2"
  bottom: "label_move2"
  include { phase: TEST }
  top: "accuracy_2"
}

layer {
  name: "loss_3"
  type: "SoftmaxWithLoss"
  # input
  bottom: "flatten_o3"
  bottom: "label_move3"
  # output
  top: "loss_3"
}

layer {
  name: "accuracy_3"
  type: "Accuracy"
  bottom: "flatten_o3"
  bottom: "label_move3"
  include { phase: TEST }
  top: "accuracy_3"
}
