name: "LeelaNet"
layer {
  type: "Data"
  name: "data"
  # outputs
  top: "data_unsliced"
  top: "label_move1"
  include {
    phase: TRAIN
  }
  data_param {
    source: "leela_train"
    batch_size: 64
    backend: LEVELDB
  }
}

layer {
  type: "Data"
  name: "data"
  # outputs
  top: "data_unsliced"
  top: "label_move1"
  include {
    phase: TEST
  }
  data_param {
    source: "leela_test"
    batch_size: 64
    backend: LEVELDB
  }
}

layer {
  name: "slicer_label"
  type: "Slice"
  bottom: "data_unsliced"
  top: "data"
  top: "label_move2"
  top: "label_move3"
  slice_param {
    axis: 1
    slice_point: 24
    slice_point: 25
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  # input -> output
  bottom: "data"
  top: "conv1"
  # learning rate and decay multipliers for the filters
  param { lr_mult: 1 decay_mult: 1 }
  # learning rate and decay multipliers for the biases
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  # in-place
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "bn1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  # input -> output
  bottom: "bn1"
  top: "conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu2"
  type:  "ReLU"
  # in-place
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "bn2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  # input -> output
  bottom: "bn2"
  top: "conv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  # in-place
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "bn3"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "conv4"
  type: "Convolution"
  # input -> output
  bottom: "bn3"
  top: "conv4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "relu4"
  type: "ReLU"
  # in-place
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "bn4"
  type: "BatchNorm"
  bottom: "conv4"
  top: "bn4"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "conv5"
  type: "Convolution"
  # input -> output
  bottom: "bn4"
  top: "conv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 3
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant" # initialize the biases to zero (0)
    }
  }
}

layer {
  name: "slicer_output"
  type: "Slice"
  bottom: "conv5"
  top: "conv5_o1"
  top: "conv5_o2"
  top: "conv5_o3"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
  }
}

layer {
  name: "flatten_o1"
  type: "Flatten"
  bottom: "conv5_o1"
  top: "flatten_o1"
}

layer {
  name: "flatten_o2"
  type: "Flatten"
  bottom: "conv5_o2"
  top: "flatten_o2"
}

layer {
  name: "flatten_o3"
  type: "Flatten"
  bottom: "conv5_o3"
  top: "flatten_o3"
}

layer {
  name: "flatten_l2"
  type: "Flatten"
  bottom: "label_move2"
  top: "label_move2_f"
  flatten_param {
    axis: 1
  }
}

layer {
  name: "argmax_l2"
  type: "ArgMax"
  bottom: "label_move2_f"
  top: "label_move2_m"
}

layer {
  name: "flatten_l3"
  type: "Flatten"
  bottom: "label_move3"
  top: "label_move3_f"
  flatten_param {
    axis: 1
  }
}

layer {
  name: "argmax_l3"
  type: "ArgMax"
  bottom: "label_move3_f"
  top: "label_move3_m"
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  # input
  bottom: "flatten_o1"
  bottom: "label_move1"
  # output
  top: "loss"
  loss_weight: 0.5
}

layer {
  name: "loss_2"
  type: "SoftmaxWithLoss"
  # input
  bottom: "flatten_o2"
  bottom: "label_move2_m"
  # output
  top: "loss_2"
  loss_weight: 0.3
}

layer {
  name: "loss_3"
  type: "SoftmaxWithLoss"
  # input
  bottom: "flatten_o3"
  bottom: "label_move3_m"
  # output
  top: "loss_3"
  loss_weight: 0.2
}

layer {
  name: "accuracy"
  type: "Accuracy"
  # input
  bottom: "flatten_o1"
  bottom: "label_move1"
  include {
    phase: TEST
  }
  # output
  top: "accuracy"
}
